{"meta":{"title":"七崽的博客","subtitle":"Se7en's blog","description":"自带弹幕的程序猿","author":"Se7en","url":"http://se7en.blog","root":"/"},"pages":[],"posts":[{"title":"","slug":"减少包大小研究与应用——资源篇","date":"2019-11-14T11:21:50.432Z","updated":"2019-11-14T11:26:49.564Z","comments":true,"path":"posts/0/","link":"","permalink":"http://se7en.blog/posts/0/","excerpt":"","text":"减少包大小研究与应用——资源篇 压缩图片 工程中常用的图片格式 了解不同图片格式特点有助于我们在不同的业务场景选择更好的解决方案。 png 与其它图片格式相对来说是『无损』的，文件较小，强大的透明度支持，因此是应用最多的静态图片格式。PNG分为PNG8和PNG24，这两种图片的大小差距巨大，PNG8特别轻量级，但是透明度和渐变都会有损失。所以不透明的没有渐变的切图可以采用PNG8的格式导出，能节省很多储存空间。 svg 低文件大小的高质量图图像的绝佳选择，可惜的只有iOS客户端可以很好的支持它。 gif 代表图形交换格式。主要作为动画资源文件格式，优点之一是保留了透明度，但透明度不是选择性的，这意味着，如果使颜色透明，则该颜色将在整个图像中变为透明。 webp 是Google在2010年提出的一种新的图片压缩格式。优势是提供了更优的图像数据压缩算法，能带来的更小的图片体积。但是需要注意的是，webp在iOS解码的时间比png长，当页面大量使用webp时iOS客户端带来的性能问题会非常明显。 jpeg 是全彩图像，每个像素至少24位存储空间，常用来作为多种颜色的照片保存格式。但是这种格式是『有损的』，它们保留了所有颜色信息，但是通过有选择地丢弃数据来压缩文件大小，并且这种压缩会导致质量下降。JPG适用于没有透明度，超多渐变和光影复杂的图片格式，类似照片的图片效果，这种图片导出为JPG，压缩率调整为60%-70%时，对于图片视觉上的损失效果不明显，但是体积比PNG24要小很多，所有JPG这种适合用在大块带光影的背景处理上。 移动端图片资源压缩方案 TinyPng 这些年出现了很多图片压缩工具，但TinyPNG依然是最好的图片压缩工具之一。 智能压缩。几乎不会损坏图片质量。同类工具相比有最大的压缩比例且几乎不会损坏图片质量。 最大支持5MB，这在移动端来说足够使用。 拥有Photoshop插件 每月免费500API额度，只要在注册页面填入邮箱就可以获取API，支持用npm安装tinyfy库，每次上线前用脚本跑一遍就可以压缩所有图片，对程序猿简直不要太友好。 智图 是腾讯ISUX前端团队出品的图片优化工具。主要功能包括: 生成webp格式图像，占据更小空间 替换原图，图片压缩后自动替换原图片，减少不必要操作 自动格式转换，根据图片类型，自动转换PNG和JPG格式 裁剪缩放，裁剪尺寸压缩图片大小 在网上测评中，同类Png图片TinyPNG压缩率在 70% 左右，而智图只有 30% 。但这不意味着智图不如国外工具好用，只是各有侧重。还可能跟腾讯常使用的前端图片方案和工作流程有关系。 减少冗余资源 未使用资源 非图片部分主要包括音频，字体这部分，需要靠人力去排查。 图片部分常用的工具就是LSUnusedResources和FengNiao。两者的原理是差不多的，先查找出项目中所有使用的字符串和项目中所有的资源文件。然后二者进行匹配对比，计算差集就是未使用的资源。区别在于LSUnusedResources是可视化工具，而FengNiao是命令行工具，所以可以在Xcode中添加Run Script,在每次构建的时候自动检测未使用的资源。 重复资源 主要借助fdupes开源工具。fdupes有各种选项，可以实现对文件的列出、删除、替换为文件副本的硬链接等操作。 文件对比以下列顺序开始： 大小对比 &gt; 部分 MD5 签名对比 &gt; 完整 MD5 签名对比 &gt; 逐字节对比 关于视图资源 这里所说的视图资源是指xib/storyboard。xib在打包时会被压缩为nib文件，storyboard文件会被压缩为storyboardc文件，storyboardc 是个压缩包，内部包含了相应的nib和一个plist文件。一般的nib文件压缩后在几KB到几十KB大小这部分包大小的影响相对于xib能提高开发效率来说影响是微乎及微的。 而Masonry由于用block设计的接口，由于block的特性，一个复杂的列表类在最后生成Mach-o文件也可能多出十几KB不止（与Frame布局相比较）。所以对布局方案的选择，包大小不能作为主要的考量。","categories":[],"tags":[]},{"title":"Hello World","slug":"hello-world","date":"2019-11-14T11:18:23.562Z","updated":"2019-11-14T11:18:23.562Z","comments":true,"path":"posts/4a17b156/","link":"","permalink":"http://se7en.blog/posts/4a17b156/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick Start Create a new post 1$ hexo new \"My New Post\" More info: Writing Run server 1$ hexo server More info: Server Generate static files 1$ hexo generate More info: Generating Deploy to remote sites 1$ hexo deploy More info: Deployment","categories":[],"tags":[]}]}